# TotalPressureLoss Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
MEPSection..::..TotalPressureLoss Property
MEPSection Class See Also
---
The total pressure loss of the section.
**Namespace:** Autodesk.Revit.DB.Mechanical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public double TotalPressureLoss { get; }
```

Visual Basic
---
```text
Public ReadOnly Property TotalPressureLoss As Double
	Get
```

Visual C++
---
```text
public:
property double TotalPressureLoss {
	double get ();
}
```

# Remarks
It's total of all fittings and segments. Default unit is Kgf per square feet. For Duct, unit type is UT_HVAC_Pressure. For Pipe, unit type is UT_Piping_Pressure.
# See Also
MEPSection Class
Autodesk.Revit.DB.Mechanical Namespace